/*关于float精度问题
float score;
    printf("请输入小明的成绩:"); 
    scanf("%f",&score);
    
    printf("小明的成绩是：%.1f",score)*/
   //* 关于float的控制，默认为六位小数，需要限制：%.(限制的位数)f


/*关于\n,是c语言中的转义字符，作用：让光标移动到下一行
例如： printf("小明的学号为：%d,小明的成绩为：%.1f,小明的等级为: %c",a,score,LV);
//*此处没有在%C后面加上\n,导致最终会将终端符号%一起输出，比如输出为A%
*/

/*浮点计算转化
例子  英尺英寸与米之间的转换
    int foot;
    int inch;

     scanf("%d %f",&foot,&inch);//定义时为什么要加&
     printf("身高是%.2f米。\n",(foot+inch/12)*0.3048);
此处要保证英尺能够起到作用，应为英尺/12很有可能会是一个浮点数（英尺英寸是十二进制）
//*要改变变量参与类型方法一，将变量改为float或者double形式,注意⚠️，换用double那里的格式字符串改为%lf，输出位置的格式字符串可以继续用%f
            //* 方法二，将/12的位置强行转化为12.0，也就是强行从整数转化成浮点数,注意⚠️，此方法变量定义虽然可以不动，但是下方输出的位置必须改为%f
        要使用dev c进行验证*/
/*
        //*限定浮点数位数
        只有在输出部分（printf）才需要对浮点数进行限制
        在下定义部分（scanf）不需要进行浮点数限制*/

        //*scanf定义不能够在里面加入提示语，只能够加上限定类型的格式字符串

        //*在关于if的数字比较情况中，三种情况a==b,a>b,a<b都必须考虑到，否则会出现程序报错的可能性


    
        
//*else if与else的区别
/*else if可以在后面加上括号用来重新使用定义的运算法则，下面加上printf进行输出就可以了
单独一个else则不能够再次定义计算法则，而是直接按照前文中if的反例进行计算
//*详情见《翁恺，多重假设回旋，找零计算器》
*/

/*else总是与最近的那一个if匹配*/


//*warning并不是错误，而是警告，意思是程序可以运行，但是可能会出现一些问题

//*关于if的嵌套使用
   /*if(条件1){
        if(条件2){
            语句1;
        }else{
            语句2;
        }
    }else{
        语句3;
    }*/

    //*因变量在书写时也必须进行定义，否则会出现报错的情况
    /*例如，a=b+c，在书写时除了定义b和c以外，还要定义a
    int a,b,c;*/

//*有scanf就不需要变量定义了

//*计算机中的除法（/）结果只输出整数，小数省略

//*关于for循环的使用
//for循环括号内是分号for（a;b;c）a是初始条件，b是循环条件，c是每次循环结束后需要做的事情

//*除开输入的条件变量，其他变量必须进行事先赋值定义，否则可能会输出一些十分离谱的数
/*例如，int a,b,c;scanf("%d %d",&a,&b);c=a+b;printf("%d",c);此时如果没有对c进行赋值定义，则可能会输出一些离谱的数
    //*因此，除了输入的变量以外，其他变量必须进行事先赋值定义，否则可能会输出一些十分离谱的数
    //*例如，int a,b,c;scanf("%d %d",&a,&b);c=a+b;printf("%d",c);此时如果没有对c进行赋值定义，则可能会输出一些离谱的数
    */