//*越是接近底层的，早期的语言越强调数据类型的定义
/*关于C语言的定义
整数包含 char（1字节-128～127） short（2字节-32768-32768） int（正负2的32次方-1） long（4字节） longlong（8字节）
浮点数包括float double longdouble
逻辑 bool
指针
自定义类型*/
//*sizeof，是一个运算符，可以给出莫哥类型或者变量在内存中所占据的字节数，例如：sizeof（int）printf("%ld\n"sizeof(int))
//*sizeof是静态的，结果在编译时就已经定好了。不会计算括号内的内容

//*表达负数：采用补码的方式
/*例子：在二进制中1表达为00000001，如何将之表达为二进制的0？按照十进制应当是-1+1等于0
而在二进制中1+1进位会变为10，而二进制存储只会保存8位数，多出的一位会自动舍弃掉
所以采用部位也就是进位的方式解决负数二进制加减
比如00000001=11111111=100000000，多处的一位数会自动舍弃，最终答案变为00000000
所有-1=00000000-00000001=11111111（在补码是这个数字是255，被当作是补码时为-1；
*/ //*所以对于某进制的负数即为0-a，即a的基数次方-a
/*代码举例：char c=255;（unsigned char c=255，结果就是255，完全告诉他就是二进制，扩大正数部分）
           int a=255;
输出时c=-1而a=255
//*由于char类型只有1字节8bit，所以结果上为11111111；而int有四字节32bit，所以最终结果为00000000 00000000 00000000 11111111

*/

//* %d %u %ld %lu 0开头为8进制（%o），0X开头为16进制（%x）

//*逃逸字符例子：/“是一个字符，用来表示在双引号里面的双引号

//*类型转换