/*诸如%f一类称为格式字符串*/

/*
//*关于scanf
1,作用：从键盘读取用户的输入，并把输入的内容保存到指定的变量里{f指的是formatted(格式化的)}
与printf组成一块，一个代表输入，一个代表输出
2，标准语法格式scanf(“格式控制字符串「有几个变量就打几个」”，&变量地址1，&变量地址2)；
3，//*关于地址符&必须要记住
例如存在定义变量foot，foot作为一个空盒子，要加入&才能告诉他应该往这个盒子里面装


*/
//*计算相关
/*运算符：是指进行运算的动作，比如加法的+和减法的-
  算子：参与运算的值，可以是常数（5+5），也可以是变量（a+b）
  %：用来取余数
  =：为赋值符号，在计算机中也是一个完整的过程，而且=的优先级比任何运算符都来的低
  比如a=b=c+5

  */
 /*复合赋值
 例如+=，-=等，a+=2即a=a+2
 递增递减运算符：++和--只有一个变量，使得变量+1或者变量—1
 a++作为一个表达式，其值为a的原值，但a的值会增加1，在这一步，a的值已经增加了1
 ++a作为一个表达式，其值为a的新值，且a的值会增加1
 INC=递增，DEC=递减
 现在的IDE写成a=a+1也可以运行
 */

 /*//*关系运算符
 = =相等
 ！=不相等
 >大于
 >=大于或者等于
 <小于
 <=小于等于
 /=除与赋值 例如X/=10，为X除以10之后再将结果赋值给X*/

 /*//*计算中的优先级：所有的关系运算符的优先级比算术运算低，但是比赋值运算高
 例如7>=3+4
 int r=>0;
 ==和！=的优先级相当低
 */