//if语句
/*if（条件成立）{
  ,,,,,
}*/

//*假如与否则
/*if(){

}else if(){

}*/
//*else if与else的区别
/*else if可以在后面加上括号用来重新使用定义的运算法则，下面加上printf进行输出就可以了
单独一个else则不能够再次定义计算法则，而是直接按照前文中if的反例进行计算
//*详情见《翁恺，多重假设回旋，找零计算器》
*/

//*在C语言中，const 变量本质上是“只读变量”，而非真正的“常量”。*/


//*if 与{}
/*例子：
      int a=0;
      int b=0;
      ...
      if(a<b){//*一号if
         if(b>0)//*二号if
         printf("good")
         
         }else
         printf("bad")
         *///*此时这个else是前面的那一个if所配套的而不是括号里面那一个
         //*这样就导致只有在第一个if条件不满足时才会进行else程序，否则如果是一号成立而二号不成立，则会导致程序运行停止
         //*这就是else的就近原则，即else与最近的那一个if相配套


        //*switch case语法
        /*switch (type)
        {
        case1
        case2
            printf();
            break;
            }*///*break在此处会使得完成某一选项后退出整个switch序列
            //*这里这个Type需要在上方进行变量定义

//*switch case与if else的区别
        /*switch case只能进行整数类型的判断，而if else可以进行任意类型的判断
        //*switch case在进行判断时，必须要有一个break语句来结束整个case序列，否则会导致程序继续执行下去
        //*而if else则不需要break语句，因为它是通过条件判断来决定是否执行某一段代码
        */

//*while循环语法
        /*while(条件成立){
            ,,,,,
        }*/
//*while循环与do while循环的区别
        /*while循环是先判断条件是否成立，再执行循环体，而do while循环是先执行循环体，再判断条件是否成立
        //*因此，do while循环至少会执行一次循环体，而while循环可能一次都不执行
        
        while循环
        将while翻译为当条件成立时，执行循环体*/

//*do while循环 将do while翻译为先执行循环体，再判断条件是否成立，如果成立则继续执行循环体，否则退出循环
       /* do
        {
            ,,,,,在do和while之间的为循环体，它必然进行一次，在执行后再判断条件是否成立，若成立则继续执行循环体，若不成立则结束循环
        }while(条件成立);*/

//*随机数rand()函数
        /*rand()函数是C语言中的一个标准库函数，用于生成随机数。它返回一个0到RAND_MAX之间的整数，其中RAND_MAX是一个常量，表示rand()函数可以返回的最大值。*/
        
//*x%n的结果是【0，n-1】的一个整数
/*写法为rand()%n*/

//*for循环语法
        /*for(初始化;循环继续的条件;更新【每次循环结束后进行的操作】){
            ,,,,,
}
            由于一些时候用来判断循环是否继续进行的变量在循环之外并不会产生作用，所以对于该变量的定义环节可以移动到循环括号内进行
            例如：for(int i=1;i<=u;i++)
            这种写法只适用于C99模式下，在报错时需要对其进行定义*/
//*对于循环的使用：
/*1，如果有固定次数，用for（因为可用判断的方式来限定次数）
  2，如果必须执行一次，用do while
  3，其他情况大多数使用while*/