//*为什么一个变量double定义最后用f输出？
/*在C语言中%f不仅可以输出单精度也可以输出双精度，在输出中%f就是迎来处理浮点数的*/

//*关于强制类型转化，情景引入：整数除法
/*double c=(double)a/b
或double c=1.0*a/b */
 
//*百分数作为结果输出为什么是%f%%
/* %是格式占位符，告诉程序这里要放什么数
而%%则是告诉程序，这里要放一个百分号 */

//*针对double型的变量定义
/*scanf("%lf",a);*/

//*针对longlong型的变量定义
/*scanf("%lld",a);*/

//*scanf("%s", s); 注意：字符串数组名本身就是地址，不需要加 &），一般用上字符库才考虑

//*什么是 s[i]？
/*在 C 语言中，s[i] 表示访问字符数组 s 中下标为 i 的那个字符。可以当成数列的字母下标*/

//*&&是以及的意思

//*多重嵌套if语句一定要保证有头有尾（一定要要检查是不是一个if对应一个else，尤其是主if）

//*｜｜是或者的意思

//*计算机必须通过特殊符号来进行并行判断
/*例：if (2<b < 10) { ... }该式子错误，当计算机判断为2<b成立时就会输出1（是）导致下一步变成了b<10
正确的应该是
if (2<b && b<10) { ... }
*/

//*计算形式，一定要记住，C中关于/是不会输出小数部分的，必须改为小数除法形式。例：1.0/2=q才可以进行小数除法计算